src/InformationRegisters/КВП_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КВП_ЛицевыеСчета</Name>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛицевойСчет</Name>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГП_ЗданияБП77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГП_ЗданияБП77</Name>
			<Comment>// Гарант+</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УлицаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УлицаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УлицаКодГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Улица2</Name>
					<Comment>Улица, проспект и т. п.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реквизиты</Name>
					<Comment>Контактные реквизиты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоДляКанализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентХВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентГВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролерКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролерНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетчикКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетчикНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПотребителяКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПотребителяНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоНегативноеВоздействиеЦСВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПлатаЗаХолодноеВодоснабжениеОИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоговорКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>85</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодозаборКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодозаборНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КонтрагентКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАбонентаКод</Name>
					<Comment>Код объекта абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КВП_Здания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГП_ДоговорыБП77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГП_ДоговорыБП77</Name>
			<Comment>// Гарант+</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>85</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВозникновенияОбязательства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПогашенияОбязательства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаНачисленияШтрафныхСанкций</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрекращенияНачисленияШтрафныхСанкций</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаШтрафныхСанкций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДоговораКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаДоговораКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОплатаДоговора</Name>
					<Comment>// 1 - в рублях, 2 - в валюте</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременнаяЕдиницаРасчетаШтрафныхСанкций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоОбработкаНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетРасчетовУЕ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьСуммовуюРазницуПриЗачетеАванса</Name>
					<Comment>Отражать суммовую разницу при зачете аванса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКорректировкиКурсаУЕ</Name>
					<Comment>Процент автоматической корректировки курса условной единицы, указанного в документе, выполняемой при проведении документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодаПоДог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КанПоДог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговораНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КонтрагентКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ГП_МиграцияКонтактнойИнформации/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьКонтактнуюИнформациюПоПредставлению(Представление, ОжидаемыйВид) Экспорт
    Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Представление, ОжидаемыйВид);
КонецФункции

Функция ЗаполнитьАдресаДоставкиСчетовИКвитанцийЛицевыхСчетов()
    ДанныеЗаполнения = ПолучитьЛицевыеСчетаДляУстановкиАдресаДоставкиСчетовИКвитанций();

    Для Каждого СтрокаДанных Из ДанныеЗаполнения Цикл
        СтруктураАдресаБП77 = Новый Структура("Улица, Дом, Строение, Квартира");
        СтруктураАдресаБП77.Вставить("ПредставлениеАдресаКонтрагента", ?(ПустаяСтрока(СтрокаДанных.ПочтовыйАдресКонтрагентаБП77) = Ложь,
                    СтрокаДанных.ПочтовыйАдресКонтрагентаБП77, СтрокаДанных.ЮридическийАдресКонтрагентаБП77));
        СтруктураАдресаБП77.Улица = ?(ПустаяСтрока(СтрокаДанных.Улица) = Ложь, СокрЛП(СтрокаДанных.Улица), СокрЛП(СтрокаДанных.Улица2));
        СтруктураАдресаБП77.Дом = СтрокаДанных.Дом;
        СтруктураАдресаБП77.Строение = СтрокаДанных.Корпус;
        СтруктураАдресаБП77.Квартира = СтрокаДанных.Квартира;

        ПредставлениеТекущегоАдреса = СтрокаДанных.ПредставлениеКИ;
        СтруктураТекущегоАдреса = УправлениеКонтактнойИнформациейБП.СтруктураАдреса(
                СтрокаДанных.ЗначениеКИ, Новый Структура("НаименованиеВключаетСокращение", Истина));

        Если ПустаяСтрока(СтруктураАдресаБП77.Улица) И ПустаяСтрока(СтруктураАдресаБП77.Дом) Тогда
            Продолжить;
        КонецЕсли;

    КонецЦикла;

    Возврат Неопределено;
КонецФункции

Функция СформироватьАдресДоставкиСчетовИКвитанцийЛицевогоСчет(Знач СтруктураАдресаБП77, Знач АдресКонтрагента = Неопределено)
    АдресКонтрагентаJSON = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
        СтруктураАдресаБП77.ПредставлениеАдресаКонтрагента);
    СтруктураАдресаКонтрагента = УправлениеКонтактнойИнформациейБП.СтруктураАдреса(
        АдресКонтрагентаJSON, Новый Структура("НаименованиеВключаетСокращение", Истина));

    Возврат Неопределено;
КонецФункции

#Область СборДанных

Функция ПолучитьЛицевыеСчетаДляУстановкиАдресаДоставкиСчетовИКвитанций() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = ПолучитьТекстЗапросаЛицевыхСчетовДляУстановкиАдресаДоставкиСчетовИКвитанций();

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СборДанных

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область ТекстыЗапросов

Функция ПолучитьТекстЗапросаЛицевыхСчетовДляУстановкиАдресаДоставкиСчетовИКвитанций() Экспорт
    РезультатФункции =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ЛицевыеСчета.Период КАК Период,
        |	ЛицевыеСчета.Регистратор КАК Регистратор,
        |	ЛицевыеСчета.НомерСтроки КАК НомерСтроки,
        |	ЛицевыеСчета.Активность КАК Активность,
        |	ЛицевыеСчета.Объект КАК Объект,
        |	ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
        |	ЛицевыеСчета.Действует КАК Действует,
        |	ЛицевыеСчета.УдалитьКоличествоПроживающих КАК УдалитьКоличествоПроживающих,
        |	ЛицевыеСчета.УдалитьКоличествоЗарегистрированных КАК УдалитьКоличествоЗарегистрированных
        |ПОМЕСТИТЬ ВТ_ДействующиеЛицевыеСчета
        |ИЗ
        |	РегистрСведений.КВП_ЛицевыеСчета.СрезПоследних(, ) КАК ЛицевыеСчета
        |ГДЕ
        |	ЛицевыеСчета.Действует = ИСТИНА
        |	И ЛицевыеСчета.ЛицевойСчет.Идентификатор ПОДОБНО ""%00005623""
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ЗданияБП77.*,
        |	ЗданияБП77.ОбъектАбонентаКод + ""_"" + ЗданияБП77.КонтрагентКод КАК ИдентификаторЛС,
        |	КонтрагентыБП77.ЮридическийАдрес КАК ЮридическийАдресКонтрагентаБП77,
        |	КонтрагентыБП77.ПочтовыйАдрес КАК ПочтовыйАдресКонтрагентаБП77,
        |	КонтрагентыБП77.Наименование КАК НаименованиеКонтрагентаБП77,
        |	КонтрагентыБП77.ПолнНаименование КАК ПолнНаименованиеКонтрагентаБП77,
        |	КонтрагентыБП77.ОсновнойДоговорКод КАК КодОсновногоДоговораКонтрагентаБП77,
        |	КонтрагентыБП77.ОсновнойДоговорНаименование КАК НаименованиеОсновногоДоговораКонтрагентаБП77,
        |	ЕСТЬNULL(ДоговорыБП77.Номер, """") КАК НомерОсновногоДоговораБП77
        |ПОМЕСТИТЬ ВТ_ЗданияБП77
        |ИЗ
        |	РегистрСведений.ГП_ЗданияБП77 КАК ЗданияБП77
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГП_КонтрагентыБП77 КАК КонтрагентыБП77
        |		ПО ЗданияБП77.КонтрагентКод = КонтрагентыБП77.Код
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГП_ДоговорыБП77 КАК ДоговорыБП77
        |		ПО ЗданияБП77.КонтрагентКод = ДоговорыБП77.КонтрагентКод
        |			И (ДоговорыБП77.Код <> """")
        |			И (КонтрагентыБП77.ОсновнойДоговорКод = ДоговорыБП77.Код)
        |ГДЕ
        |	ЗданияБП77.КонтрагентКод <> """"
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	КонтактнаяИнформацияЛС.Ссылка КАК Ссылка,
        |	МАКСИМУМ(КонтактнаяИнформацияЛС.НомерСтроки) КАК НомерСтроки,
        |	КонтактнаяИнформацияЛС.Тип КАК Тип,
        |	КонтактнаяИнформацияЛС.Вид КАК Вид
        |ПОМЕСТИТЬ ВТ_КонтактнаяИнформацияЛС_Подготовка
        |ИЗ
        |	Справочник.КВП_ЛицевыеСчета.КонтактнаяИнформация КАК КонтактнаяИнформацияЛС
        |ГДЕ
        |	КонтактнаяИнформацияЛС.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
        |	И КонтактнаяИнформацияЛС.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.УПЖКХ_АдресДоставкиСчетовИКвитанцийЛицевогоСчета)
        |	И КонтактнаяИнформацияЛС.Ссылка В
        |			(ВЫБРАТЬ
        |				Т.ЛицевойСчет
        |			ИЗ
        |				ВТ_ДействующиеЛицевыеСчета КАК Т)
        |СГРУППИРОВАТЬ ПО
        |	КонтактнаяИнформацияЛС.Ссылка,
        |	КонтактнаяИнформацияЛС.Тип,
        |	КонтактнаяИнформацияЛС.Вид
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	КонтактнаяИнформацияЛС.Ссылка КАК ЛицевойСчет,
        |	КонтактнаяИнформацияЛС.НомерСтроки КАК НомерСтроки,
        |	КонтактнаяИнформацияЛС.Тип КАК Тип,
        |	КонтактнаяИнформацияЛС.Вид КАК Вид,
        |	КонтактнаяИнформацияЛС.Представление КАК Представление,
        |	КонтактнаяИнформацияЛС.ЗначенияПолей КАК ЗначенияПолей,
        |	КонтактнаяИнформацияЛС.Страна КАК Страна,
        |	КонтактнаяИнформацияЛС.Регион КАК Регион,
        |	КонтактнаяИнформацияЛС.Город КАК Город,
        |	КонтактнаяИнформацияЛС.АдресЭП КАК АдресЭП,
        |	КонтактнаяИнформацияЛС.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
        |	КонтактнаяИнформацияЛС.НомерТелефона КАК НомерТелефона,
        |	КонтактнаяИнформацияЛС.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
        |	КонтактнаяИнформацияЛС.Значение КАК Значение
        |ПОМЕСТИТЬ ВТ_КонтактнаяИнформацияЛС
        |ИЗ
        |	Справочник.КВП_ЛицевыеСчета.КонтактнаяИнформация КАК КонтактнаяИнформацияЛС
        |ГДЕ
        |	(КонтактнаяИнформацияЛС.Ссылка, НомерСтроки, КонтактнаяИнформацияЛС.Тип, Вид) В (
        |		ВЫБРАТЬ Т.Ссылка, Т.НомерСтроки, Т.Тип, Т.Вид ИЗ ВТ_КонтактнаяИнформацияЛС_Подготовка КАК Т)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ВТ_ДействующиеЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
        |	ВТ_ЗданияБП77.*,
        |	НЕ (ВТ_ДействующиеЛицевыеСчета.ЛицевойСчет ЕСТЬ NULL) КАК ЕстьКонтактнаяИнформация,
        |	ВТ_КонтактнаяИнформацияЛС.Представление КАК ПредставлениеКИ,
        |	ВТ_КонтактнаяИнформацияЛС.ЗначенияПолей КАК ЗначенияПолейКИ,
        |	ВТ_КонтактнаяИнформацияЛС.Страна КАК СтранаКИ,
        |	ВТ_КонтактнаяИнформацияЛС.Регион КАК РегионКИ,
        |	ВТ_КонтактнаяИнформацияЛС.Город КАК ГородКИ,
        |	ВТ_КонтактнаяИнформацияЛС.АдресЭП КАК АдресЭПКИ,
        |	ВТ_КонтактнаяИнформацияЛС.ДоменноеИмяСервера КАК ДоменноеИмяСервераКИ,
        |	ВТ_КонтактнаяИнформацияЛС.НомерТелефона КАК НомерТелефонаКИ,
        |	ВТ_КонтактнаяИнформацияЛС.НомерТелефонаБезКодов КАК НомерТелефонаБезКодовКИ,
        |	ВТ_КонтактнаяИнформацияЛС.Значение КАК ЗначениеКИ
        |ИЗ
        |	ВТ_ДействующиеЛицевыеСчета КАК ВТ_ДействующиеЛицевыеСчета
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗданияБП77 КАК ВТ_ЗданияБП77
        |		ПО ВТ_ДействующиеЛицевыеСчета.ЛицевойСчет.Идентификатор = ВТ_ЗданияБП77.ИдентификаторЛС
        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформацияЛС КАК ВТ_КонтактнаяИнформацияЛС
        |		ПО ВТ_ДействующиеЛицевыеСчета.ЛицевойСчет = ВТ_КонтактнаяИнформацияЛС.ЛицевойСчет
        |";

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ТекстыЗапросов

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
